Hi, seeing this as well trying to add custom cache key actions to an existing page rule without a previous `cache_key_fields` spec:

```
2020-10-08T14:17:47.953-0700 [DEBUG] plugin.terraform-provider-cloudflare_v2.11.0: 2020/10/08 14:17:47 [DEBUG] cache_key_fields action to be applied: []interface {}{map[string]interface {}{"cookie":[]interface {}{map[string]interface {}{"check_presence":[]interface {}{}, "include":[]interface {}{}}}, "header":[]interface {}{map[string]interface {}{"check_presenc
2020-10-08T14:17:47.956-0700 [DEBUG] plugin.terraform-provider-cloudflare_v2.11.0: panic: interface conversion: interface {} is nil, not map[string]interface {}
```

```
resource "cloudflare_page_rule" "cache-interface-css" {
  zone_id = var.cloudflare_zone_id
  target = "subdomain.${var.cloudflare_zone_name}/*.css"
  priority = 14

  actions {
    always_use_https = true
    true_client_ip_header = "on"
    cache_key_fields {
      header {}
      query_string {
        include = ["cache"]
      }
      user {}
      cookie {}
      host {}
    }
    cache_level = "cache_everything"
    edge_cache_ttl = 3600
  }
}
```

Plan
```
  # cloudflare_page_rule.cache-interface-css will be updated in-place
  ~ resource "cloudflare_page_rule" "cache-interface-css" {
        id       = "3f528491f1c3750e22f873174ea6e188"
      ~ priority = 1 -> 2
        status   = "active"
        target   = "subdomain.cloudflare.com/*.css"
        zone_id  = "3f528491f05d5d88ff5b419e4ea6e188"

      ~ actions {
            always_use_https      = true
            disable_apps          = false
            disable_performance   = false
            disable_railgun       = false
            disable_security      = false
            edge_cache_ttl        = 604800
            host_header_override  = "subdomain.s3.amazonaws.com"
            resolve_override      = "subdomain.cloudflare.com"
            true_client_ip_header = "on"

          + cache_key_fields {
              + cookie {
                  + check_presence = (known after apply)
                  + include        = (known after apply)
                }

              + header {
                  + check_presence = (known after apply)
                  + exclude        = (known after apply)
                  + include        = (known after apply)
                }

              + host {}

              + query_string {
                  + exclude = (known after apply)
                  + ignore  = true
                  + include = (known after apply)
                }

              + user {}
            }
        }
    }
```